lib/connectors/digistore24/__fixtures__/glyco-on-payment.json

{
  "add_url": "https://www.checkout-ds24.com/order/add/TEST0001/TESTKEY01",
  "address_city": "Test City",
  "address_company": "",
  "address_country": "CA",
  "address_country_name": "Canada",
  "address_first_name": "Test",
  "address_id": "11111111",
  "address_last_name": "Buyer",
  "address_state": "ON",
  "address_street": "123 Test Street",
  "address_street_name": "Test Street",
  "address_street_number": "123",
  "address_zipcode": "A1A 1A1",
  "affiliate_commission": "0.00",
  "affiliate_id": "1111111",
  "affiliate_name": "testaff01",
  "amount": "294.00",
  "amount_affiliate": "240.00",
  "amount_brutto": "294.00",
  "amount_credited": "0.00",
  "amount_fee": "0.00",
  "amount_main_affiliate": "240.00",
  "amount_netto": "294.00",
  "amount_partner": "0.00",
  "amount_payout": "269.77",
  "amount_provider": "24.23",
  "amount_vat": "0.00",
  "amount_vendor": "29.77",
  "api_mode": "live",
  "billing_city": "Test City",
  "billing_country": "CA",
  "billing_descriptor": "D24*TEST0001",
  "billing_first_name": "Test",
  "billing_id": "11111111",
  "billing_last_name": "Buyer",
  "billing_state": "ON",
  "billing_status": "completed",
  "billing_street": "123 Test Street",
  "billing_type": "single_payment",
  "billing_zipcode": "A1A 1A1",
  "buyer_address_city": "Test City",
  "buyer_address_country": "CA",
  "buyer_address_id": "11111111",
  "buyer_address_state": "ON",
  "buyer_address_street": "123 Test Street",
  "buyer_address_zipcode": "A1A 1A1",
  "buyer_email": "buyer@example.test",
  "buyer_first_name": "Test",
  "buyer_id": "22222222",
  "buyer_language": "en",
  "buyer_last_name": "Buyer",
  "campaignkey": "",
  "click_id": "test-click-id",
  "country": "CA",
  "currency": "USD",
  "custom": "",
  "custom_key": "22222222-testkey01",
  "customer_affiliate_name": "user22222222",
  "email": "buyer@example.test",
  "event": "on_payment",
  "event_label": "payment",
  "first_amount": "294.00",
  "function_call": "on_payment",
  "image_url": "/pb/img/merchant_9999999/image/product/TESTIMG01.png",
  "invoice_url": "https://www.digistore24.com/invoice/TEST0001/99999999/TESTINV01.pdf",
  "ipn_config_id": "111111",
  "ipn_config_product_ids": "all",
  "ipn_version": "1.6",
  "is_gdpr_country": "N",
  "is_payment_planned": "N",
  "item_count": "1",
  "language": "en",
  "language_name": "English",
  "merchant_id": "9999999",
  "merchant_name": "TESTMERCHANT",
  "monthly_amount": "0.00",
  "newsletter_choice": "none",
  "number_of_installments": "1",
  "order_date": "2026-04-24",
  "order_date_time": "2026-04-24 03:56:47",
  "order_details_url": "https://www.digistore24-app.com/vendor/reports/transactions/order/TEST0001",
  "order_id": "TEST0001",
  "order_item_id": "99999999",
  "order_time": "03:56:47",
  "order_type": "regular",
  "orderform_id": "111111",
  "parent_transaction_id": "99999998",
  "pay_method": "creditcard",
  "pay_sequence_no": "0",
  "payment_id": "PAYID-TEST-99999999",
  "payplan_id": "1111111",
  "product_amount": "294",
  "product_delivery_type": "shipping",
  "product_id": "111111",
  "product_language": "en",
  "product_name": "Test Product",
  "product_name_intern": "Test Product",
  "product_netto_amount": "294",
  "product_shipping_amount": "0",
  "product_txn_amount": "294",
  "purchase_key": "TESTKEY01",
  "quantity": "1",
  "receipt_url": "https://www.checkout-ds24.com/receipt/111111/TEST0001/TESTKEY01",
  "refund_days": "180",
  "renew_url": "https://www.checkout-ds24.com/renew/TEST0001/TESTKEY01",
  "request_refund_url": "https://www.digistore24.com/order/cancel/TEST0001/TESTCANC01",
  "store_url": "https://example.test/front-ds24/",
  "support_url": "https://www.digistore24.com/support/TEST0001/TESTKEY01",
  "switch_pay_interval_url": "https://www.checkout-ds24.com/order/switch/TEST0001/TESTKEY01",
  "tag": "TestTag",
  "tags": "TestTag",
  "trackingkey": "",
  "transaction_amount": "294.00",
  "transaction_currency": "USD",
  "transaction_date": "2026-04-24",
  "transaction_id": "99999999",
  "transaction_time": "03:56:54",
  "transaction_type": "payment",
  "transaction_vat_amount": "0.00",
  "upgrade_key": "TESTUPGR01",
  "upsell_no": "0",
  "upsell_path": "",
  "vat_amount": "0.00",
  "vat_rate": "0.00",
  "sha_sign": "0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000"
}
